{
  "title": "Rail Freight 101",
  "subtitle": "Everything you need to know to ship by rail — from the basics to getting your first car moving.",
  "sections": [
    {
      "id": "what-is-rail-freight",
      "title": "What Is Rail Freight?",
      "order": 1,
      "content": "Rail freight is the commercial movement of goods via railroad — a mode of transportation that has anchored North American supply chains for more than 170 years. Today, U.S. freight railroads operate approximately 140,000 route miles of track, moving roughly 1.7 trillion ton-miles of freight annually. That makes rail the largest freight network in the world by volume, and one of the most cost-efficient ways to move bulk and industrial goods over land.\n\nAt its core, rail freight works by loading commodities into or onto specialized railcars that are assembled into trains and pulled by diesel-electric locomotives. A single train can replace hundreds of trucks on the highway, which is why rail consistently delivers lower per-ton-mile costs for shipments traveling more than 500 miles. The break-even distance versus truck varies by commodity and lane, but rail's structural advantage in fuel efficiency — trains are 3 to 4 times more fuel-efficient than trucks per ton-mile — becomes more pronounced as distances increase.\n\nRail moves an enormous range of freight categories. Coal and intermodal containers together represent the two largest volume segments, but rail also handles grain, chemicals, automobiles, forest products, crude oil, fertilizers, finished metals, and consumer goods. If a commodity is measured in tons and moves long distances on a predictable schedule, rail is usually worth evaluating.\n\nFrom a shipper's perspective, rail offers two primary service options. Carload (or CL) service means a shipper loads an entire railcar with their product and it moves as a single unit. Intermodal service means containers or trailers are lifted onto flatcars, often combining a rail leg with truck pickup and delivery. Both models have distinct economics, equipment requirements, and service characteristics that shippers should understand before making mode decisions.\n\nThe rail industry operates on a private infrastructure model unique among major transportation modes. Unlike roads, airports, or waterways — which are publicly owned — the major U.S. freight railroads own, maintain, and invest in their own track. This has significant implications for how pricing, access, and service reliability work. It means railroads reinvest billions in capital each year but also means they can manage their own capacity without direct public subsidy.",
      "keyTakeaways": [
        "U.S. freight railroads operate ~140,000 route miles and move 1.7 trillion ton-miles of freight annually",
        "Rail is 3-4x more fuel-efficient than truck per ton-mile, creating a strong cost advantage on long hauls",
        "The two primary rail service modes are Carload (full car of one product) and Intermodal (containers/trailers on flatcars)",
        "Freight railroads own their own infrastructure — unlike roads or airports — which shapes pricing and service"
      ]
    },
    {
      "id": "key-players",
      "title": "Key Players: Class I, Shortlines, and Terminal Railroads",
      "order": 2,
      "content": "The North American freight railroad industry is organized into three classes based on annual revenue, with Class I railroads at the top. As of 2024, there are seven Class I railroads operating in the U.S. and Canada: BNSF Railway, Union Pacific (UP), CSX Transportation, Norfolk Southern (NS), Canadian National (CN), Canadian Pacific Kansas City (CPKC), and Kansas City Southern (KCS, now fully merged into CPKC). These carriers handle the lion's share of freight volumes and control most of the major long-haul corridors.\n\nBNSF and Union Pacific divide the western U.S. between them, with BNSF dominant in the northern and central plains and UP controlling the southern and Pacific coast corridors. CSX and Norfolk Southern split the eastern U.S., with significant overlap in the Midwest. The two Canadian Class I carriers — CN and CPKC — operate extensive networks that reach deep into the U.S., creating a fully integrated North American rail market. Each Class I has its own pricing structure, service products, equipment policies, and technology platforms, and shippers who deal with multiple railroads must navigate these differences.\n\nShortline and regional railroads are Class II and Class III carriers that operate on smaller networks — often 50 to 500 miles of track — typically serving rural communities, industrial parks, and agricultural areas that the Class I carriers have abandoned or never served. There are approximately 600 shortline railroads in the U.S., and they play a critical role as \"first-mile/last-mile\" partners. A shipper located on a shortline's track will see their car handed off to a Class I at an interchange point, then delivered by another shortline at the destination. Understanding who handles your car at each leg of its journey is essential for managing transit times and accountability.\n\nTerminal railroads are specialized carriers that operate within specific port complexes, yards, or industrial areas, switching cars between Class I railroads or between Class I main lines and industrial sidings. Examples include the Indiana Harbor Belt (Chicago area), the Terminal Railway Alabama State Docks (Port of Mobile), and numerous port terminal operators on the coasts. Terminal railroads rarely appear on a shipper's bill of lading directly, but their efficiency — or lack thereof — has an outsized impact on dwell time in major rail hubs.\n\nPrivate car owners and leasing companies are another critical player class. While railroads own their own locomotives, a significant portion of the North American railcar fleet is owned by shippers, car leasing companies (GATX, TTX, Union Tank Car, etc.), and private investors. When a shipper uses their own or a leased car, the economics change materially — they pay a lower linehaul rate but absorb the capital and maintenance cost of the car itself. Understanding equipment ownership is fundamental to calculating true rail freight economics.",
      "keyTakeaways": [
        "Seven Class I railroads (BNSF, UP, CSX, NS, CN, CPKC) handle the majority of long-haul freight on major corridors",
        "~600 shortline railroads serve as critical first-mile/last-mile connectors to rural and industrial locations",
        "Terminal railroads switch cars within port complexes and major yards — they rarely appear on bills of lading but affect dwell time",
        "A significant share of railcars are privately owned by shippers or leasing companies, not the railroads themselves"
      ]
    },
    {
      "id": "how-rail-pricing-works",
      "title": "How Rail Pricing Works",
      "order": 3,
      "content": "Rail freight pricing is fundamentally different from trucking. There is no publicly posted spot market equivalent to load boards like DAT or Truckstop. Instead, rail pricing operates through a combination of tariff rates (publicly filed rates that apply by default) and negotiated contracts (private rate agreements between railroads and individual shippers). Most high-volume shippers operate under contracts, while smaller or infrequent shippers may fall under tariff rates, which are typically higher.\n\nThe core rate structure for carload freight is expressed as a rate per car or per hundred pounds (CWT) for a given origin-destination pair and commodity. The commodity being shipped matters enormously — railroads segment pricing by STCC code (Standard Transportation Commodity Code), and the same origin-destination lane may have radically different rates for grain versus chemicals versus scrap metal. Rates reflect a combination of equipment availability, competitive intensity on the corridor, demand for the lane, and the railroad's view of the commodity's sensitivity to modal competition.\n\nFuel surcharges (FSC) are an add-on to the base rate, adjusted periodically — often weekly or monthly — based on a published fuel price index, typically tied to the U.S. Energy Information Administration's weekly on-highway diesel price. During periods of high diesel prices, fuel surcharges can represent 20-30% of the total freight bill. When negotiating contracts, shippers should pay close attention to how the fuel surcharge is structured — specifically whether it has a cap, a floor, or a minimum price threshold below which it does not apply.\n\nDemurrage and accessorial charges are additional line items that can significantly inflate the total cost of a shipment if not managed carefully. Demurrage is charged when cars are held at origin or destination beyond the allowed free time (typically 24-48 hours). Storage, diversion/reconsignment, bad-order car costs, and inspection fees are other common accessorials. A shipment with a competitive linehaul rate can become uneconomical if demurrage accumulates during peak periods.\n\nContract terms typically cover rate levels, minimum volumes or commitments, service standards, equipment terms (who provides cars and on what timeline), and duration (usually one to three years). Railroads increasingly expect volume commitments in exchange for competitive contract rates — shippers who fail to meet their committed volumes may face shortfall penalties or lose favorable rates at renewal. Understanding the revenue management philosophy of each Class I is important when entering contract negotiations.",
      "keyTakeaways": [
        "Rail pricing operates via private contracts (for most volume shippers) and public tariffs — there is no spot load board equivalent",
        "Rates are per-car or per-CWT for specific commodity/lane combinations; the same lane can vary dramatically by commodity",
        "Fuel surcharges are indexed to diesel prices and can represent 20-30% of total freight cost during high-price environments",
        "Volume commitments, demurrage terms, and equipment provisions are as important as the base rate in contract negotiations"
      ]
    },
    {
      "id": "equipment-101",
      "title": "Equipment 101: Railcar Types",
      "order": 4,
      "content": "Selecting the right railcar type is one of the first decisions a new rail shipper must make. Unlike trucking — where a standard 53-foot dry van can carry a wide range of freight — rail uses a large variety of specialized car types, each optimized for specific commodity categories. Using the wrong car type can mean the difference between safe, efficient transport and damaged product, regulatory violations, or simply no service at all.\n\nBoxcars are the most familiar car type and are used for packaged, bagged, or palletized freight that needs protection from weather. Modern boxcars are typically 50 to 60 feet long with sliding plug doors, and they can be equipped with load restraint systems for lighter packaged goods. They are commonly used for paper products, canned food, auto parts, and beverages. Boxcar availability has declined on most Class I railroads as intermodal has absorbed much of the traffic that once moved in boxcars.\n\nCovered hoppers are the workhorses of bulk dry commodity transport. They load through hatches on the roof and unload through gravity-fed outlets at the bottom. Small-cube covered hoppers (2,000-2,500 cubic foot capacity) are used for fertilizers, cement, and plastics pellets. Large-cube covered hoppers (4,000-4,750 cubic foot capacity) are used for grain and other low-density agricultural commodities. The outlet configuration matters: grain cars typically use round gates while cement or plastic pellet cars use trough gates or pneumatic unloading systems.\n\nOpen-top hoppers and gondolas handle bulk commodities that do not need protection from the elements — primarily coal, coke, aggregates, and scrap metal. Coal hoppers are three- or four-pocket designs that unload through bottom doors into unloading pits beneath the track. Gondolas are flat-bottomed open cars used for steel coils, pipe, scrap, and other heavy industrial materials. Rotary-dump gondolas are designed to be inverted by specialized unloading equipment at power plants and other high-volume destinations.\n\nTank cars are highly regulated vessels used for liquid and liquefied gas commodities — including chemicals, crude oil, ethanol, molten sulfur, and food-grade products like corn syrup or vegetable oil. Tank car specifications are tightly controlled by the DOT and AAR; the commodity being loaded must match the tank car's specification (jacket, lining, fittings, pressure rating). Following the Lac-Mégantic disaster in 2013, older DOT-111 tank cars have been phased out of crude oil and ethanol service in favor of stronger DOT-117 and DOT-117R specifications. Flat cars, including standard flats, bulkhead flats, and multi-level autorack cars, handle oversized loads, lumber, steel, and finished automobiles respectively.",
      "keyTakeaways": [
        "Rail uses dozens of specialized car types — the commodity must match the car specification before any pricing or service planning",
        "Covered hoppers dominate dry bulk (grain, fertilizer, plastics); small-cube vs. large-cube configurations serve different densities",
        "Tank cars are heavily regulated by DOT and AAR; car specification must match the specific chemical or liquid being transported",
        "Boxcar availability has declined as intermodal absorbed much of the packaged freight that historically moved in boxes"
      ]
    },
    {
      "id": "shipping-process",
      "title": "The Shipping Process: Step by Step",
      "order": 5,
      "content": "Understanding how a rail shipment actually moves — from the moment a shipper places a car order to the moment the car is released at destination — is essential for setting service expectations and troubleshooting problems when they arise. The process involves more parties, more handoffs, and more documentation than a typical truck shipment.\n\nThe process begins with a car order, submitted to the originating railroad (or its agent) typically 48 to 72 hours before the requested placement date. For private or leased equipment, the shipper arranges car supply directly from their fleet or through a leasing company. For railroad-furnished equipment, the shipper requests cars through the railroad's online portal, EDI transaction set, or account team. The railroad acknowledges the order and provides a Estimated Time of Availability (ETA) for the equipment.\n\nOnce the car is placed at the shipper's siding or loading facility, the shipper has a defined window of free time — typically 24 to 48 hours — to load the car and release it back to the railroad. During loading, the shipper prepares the shipping documents: a Bill of Lading (BOL), which is the legal contract of carriage, and for regulated commodities, the appropriate hazardous materials paperwork (shipping paper, emergency response information, placards). The BOL identifies the shipper, consignee, origin, destination, commodity, STCC code, car initial and number, and the rate or contract under which the car moves.\n\nAfter release, the car enters the railroad's system and begins its journey through a series of yards, classification facilities, and interchange points. The originating railroad assembles cars into trains, and the car may travel on one railroad the entire route or be interchanged to a connecting carrier. At interchange, the delivering railroad and receiving railroad conduct an inspection and formally transfer responsibility for the car. The car's movement is tracked via the railroad's car tracing system, and EDI messages (specifically the 404 Rail Carrier Shipment Information transaction) update the shipper on its position.\n\nAt the destination, the receiving railroad delivers the car to the consignee's siding or a public team track. The consignee's free time clock begins at the time of placement (or constructive placement, if the siding is occupied and the railroad notifies the consignee that the car is available). The consignee unloads the car and releases it — at which point the car is either returned to the shipper (in a private-car arrangement) or returned to the railroad's fleet. The railroad then issues a freight invoice, which the shipper audits against the agreed rate and any applicable accessorials before payment.",
      "keyTakeaways": [
        "Car orders should be placed 48-72 hours in advance; railroads issue an ETA for equipment placement",
        "The Bill of Lading is the legal contract of carriage — accuracy on commodity, STCC, and consignee information is critical",
        "Cars are tracked via EDI 404 transactions and railroad car tracing portals as they move through yards and interchanges",
        "Free time at destination starts at placement or constructive placement — unloading promptly is the best way to avoid demurrage"
      ]
    },
    {
      "id": "transloading",
      "title": "Transloading: Bridging Rail and Truck",
      "order": 6,
      "content": "Transloading is the process of transferring freight from one mode of transportation to another — most commonly from a railcar to trucks, or vice versa — at a specialized facility designed for that purpose. It is one of the most powerful tools in a shipper's logistics toolkit because it allows shippers to capture rail's long-haul economics even when their origin or destination is not directly served by rail.\n\nA transload facility is typically a warehouse or outdoor transfer point located adjacent to a rail siding. Inbound railcars arrive at the facility, and their contents are unloaded and either stored briefly or immediately transferred into trucks for local delivery. For bulk commodities — grain, fertilizer, plastics resin, building materials — transloading often happens with minimal handling: augers, pneumatic conveyors, or gravity chutes move product directly from car to truck. For palletized or packaged freight, forklifts move product through a warehouse cross-dock.\n\nThe economics of transloading are driven by the length of the rail haul and the cost of truck pickup/delivery at each end. For a shipment moving 1,000 miles or more, the savings on the rail portion often more than offset the cost of two truck legs and the transload handling fee. The calculation is less favorable for shorter hauls. Shippers who are evaluating transloading should build a full landed cost model that includes linehaul (truck and rail segments), transload handling fees, facility storage costs, transit time differences, and inventory carrying cost implications.\n\nTransload facilities vary widely in their capabilities. Some handle only specific commodity types — a liquid transload terminal, for instance, handles tank car-to-tanker-truck transfers and has specialized pumping, metering, and containment equipment. A building materials transload may specialize in wallboard, lumber, or roofing shingles. A plastics resin transload operates pneumatic conveying systems to move pellets from covered hopper cars into pneumatic trailers. Shippers should evaluate transload partners on commodity experience, equipment compatibility, insurance coverage, turnaround time, and proximity to the final customer.\n\nTransloading also provides geographic flexibility that direct rail service cannot. A shipper whose customers are spread across a region served by dozens of truck lanes can consolidate inbound rail shipments at a single transload hub and fan out delivery by truck — effectively building a private distribution network on top of the rail system. This hub-and-spoke model is widely used in the fertilizer, building products, and chemical distribution industries.",
      "keyTakeaways": [
        "Transloading transfers freight between railcars and trucks at a specialized facility, enabling rail economics for non-rail-served locations",
        "The break-even analysis must include linehaul savings, transload handling fees, dual truck legs, transit time, and inventory carrying cost",
        "Transload facilities are often commodity-specific — liquid terminals, plastics resin pads, and building products yards have different capabilities",
        "Hub-and-spoke transload models allow shippers to serve a wide customer geography from a single inbound rail consolidation point"
      ]
    },
    {
      "id": "demurrage-and-detention",
      "title": "Demurrage and Detention",
      "order": 7,
      "content": "Demurrage is a charge assessed by a railroad when a railcar is held at a shipper's or consignee's location beyond the allowed free time. It is one of the most frequently misunderstood and most preventable sources of cost in rail freight operations. Demurrage is not a penalty in the punitive sense — it is a compensation mechanism that reflects the railroad's cost of having its equipment tied up at a private facility rather than cycling through the network to generate revenue.\n\nFree time is the window during which a shipper may load (at origin) or a consignee may unload (at destination) a car without incurring charges. Standard free time on most Class I railroads is 24 to 48 hours, though it varies by railroad, car type, and the terms of individual contracts. Free time begins at the time of actual placement (when the car is physically spotted at the loading or unloading position) or constructive placement (when the railroad notifies the shipper that the car is available but cannot be placed because the track is occupied). Shippers are often surprised to learn that demurrage can accrue even before the car physically arrives at their facility.\n\nDemurrage rates are published in railroad tariffs and range from approximately $75 to $150 per car per day for the first few days, escalating significantly for extended holds. Some tariffs use a \"credit and debit\" system in which days cars are released early can be used to offset demurrage on other cars within the same billing period — this is particularly useful for shippers with variable unloading throughput who can strategically manage their overall car dwell. Other tariffs use a straight per-car-per-day model with no offset mechanism.\n\nEffective demurrage management requires operational discipline on both sides of the transaction. At origin, shippers should align car ordering with actual production schedules to avoid cars sitting idle at a loaded siding. At destination, consignees should plan their receiving operations to match inbound car volume — having adequate labor, dock capacity, and equipment to unload cars promptly. At a network level, shippers with multiple facilities can track their demurrage exposure in real time using railroad customer portals or third-party freight audit software.\n\nDisputing demurrage charges is legitimate when the railroad caused the delay — for example, if the railroad placed the car on the wrong track, delivered a bad-order car that could not be unloaded, or failed to provide constructive placement notice correctly. Shippers should maintain detailed records of car placement times, notification timestamps, and unloading completion times to support disputes. Most railroads have a formal dispute process, and charges that are clearly attributable to railroad error are typically credited without significant resistance.",
      "keyTakeaways": [
        "Demurrage accrues when cars are held beyond free time (typically 24-48 hours) and can begin even before physical car arrival via constructive placement",
        "Rates range from $75-$150/car/day initially and escalate for extended holds — even a few extra days can add meaningful cost",
        "Credit-and-debit demurrage systems allow early releases to offset late holds, offering operational flexibility for variable-volume shippers",
        "Document all placement times and notifications — charges caused by railroad error (wrong track, bad-order car) can be disputed and credited"
      ]
    },
    {
      "id": "getting-started",
      "title": "Getting Started: Is Rail Right for Your Freight?",
      "order": 8,
      "content": "The decision to add rail to your transportation mix requires honest evaluation of your freight characteristics, operational capabilities, and supply chain priorities. Rail is not the right answer for every shipment, but for many bulk and industrial commodities moving long distances, it offers compelling economics that are worth the added complexity of setup and management.\n\nStart with a freight profile assessment. Rail works best for high-density, non-fragile commodities moving in full-car quantities over distances greater than 500 miles. If your shipments are typically less-than-truckload (LTL), time-critical, or require daily delivery windows, rail is likely not a primary mode for those lanes. But if you have lanes where you regularly move 1-3 truckloads per week of the same commodity, that volume may consolidate into one or two railcars per week — enough to evaluate carload economics.\n\nNext, assess infrastructure. Do your origin and destination facilities have rail access? If not, is there a transload facility within a reasonable trucking distance? The cost of constructing a new siding or rail connection is significant — typically $500,000 to several million dollars depending on scope — and requires the railroad's cooperation. Many shippers begin with transloading to test rail economics before committing to infrastructure investment. Check the geographic coverage of the relevant Class I railroad(s) for your lanes, and identify whether any shortline connections are involved.\n\nOperationally, be prepared for longer and less predictable transit times than truck. Rail transit times for a 1,500-mile lane might range from 4 to 8 days, versus 2-3 days by truck. That transit time variability has inventory implications — most shippers who shift volume to rail need to carry 5-10 additional days of pipeline inventory to buffer against transit uncertainty. The inventory carrying cost of that additional stock is a real cost that must be included in the mode comparison.\n\nFinally, evaluate your internal capabilities. Managing rail freight well requires people who understand car tracing, demurrage, railroad billing, and equipment. If you are starting from scratch, consider partnering with a third-party logistics provider (3PL) that specializes in rail or engaging a freight audit firm with rail expertise while you build internal knowledge. The learning curve is real, but the long-term cost savings and supply chain diversification benefits are substantial for the right freight profiles.",
      "keyTakeaways": [
        "Rail is strongest for high-density, non-fragile, full-car quantities moving 500+ miles — evaluate your lane data before committing",
        "Infrastructure access (existing siding or nearby transload) is a prerequisite — transloading is a lower-commitment entry point",
        "Budget for 5-10 additional days of pipeline inventory to absorb rail transit time variability versus truck",
        "Start with a 3PL or freight audit partner with rail expertise while building internal car tracing, demurrage, and billing competency"
      ]
    }
  ]
}
